In [11]:
"https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv"

'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'

In [1]:
import pandas as pd
import numpy as np

## Basic DataFrame

Consider the following Python dictionary data and Python list labels:

```
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills', 'Cranes'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4, 3.5], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2, 2],
        'priority': ['yes', 'yes', 'no', np.nan, 'no', 'no', 'no', 'yes', 'no', 'no','yes']}
```
```
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k']
```

### `Q-1:`
i. Create a DataFrame birds from the above dictionary data which has the index labels.

ii. Display basic information about the dataFrame.

iii. Show Alternate rows of the dataframe.

In [13]:
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills', 'Cranes'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4, 3.5], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2, 2],
        'priority': ['yes', 'yes', 'no', np.nan, 'no', 'no', 'no', 'yes', 'no', 'no','yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k']

# i.
birds = pd.DataFrame(data)
birds['labels'] = labels
birds.set_index('labels', inplace=True)
birds

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      NaN
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no
k           Cranes  3.5       2      yes

In [14]:
# ii.
print(birds.info())
birds.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, a to k
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   birds     11 non-null     object
 1   age       9 non-null      float64
 2   visits    11 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 440.0+ bytes
None

            age     visits
count  9.000000  11.000000
mean   4.333333   2.818182
std    1.903943   0.873863
min    1.500000   2.000000
25%    3.500000   2.000000
50%    4.000000   3.000000
75%    5.500000   3.500000
max    8.000000   4.000000

### `Q-2:`
i. Show only rows [1st, 3rd, 7th] from columns ['bird', 'age']

ii. Select rows where the number of visits is less than 4.

In [15]:
# i.
birds[['birds', 'age']].iloc[[1, 3, 7]]

             birds  age
labels
b           Cranes  4.0
d       spoonbills  NaN
h           Cranes  NaN

In [16]:
# ii.
birds[birds['visits'] < 4]

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
c          plovers  1.5       3       no
e       spoonbills  6.0       3       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no
k           Cranes  3.5       2      yes

### `Q-3:`
i. Select all rows with nan values in age and priority column.

ii. Fill nan with respective series mode value.

In [17]:
# i.
birds[(birds['age'].isna()) & (birds['priority'].isna())]

             birds  age  visits priority
labels
d       spoonbills  NaN       4      NaN

In [18]:
# ii.
birds[birds['age'].isna()] = birds['age'].mode()[0]
birds[birds['priority'] == 3.5] = np.nan # writing this line of code because some experimental code that i wrote earlier and now is deleted, is messing with the NaN values of 'priority' column
birds

/tmp/ipykernel_11460/1633360825.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '3.5' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  birds[birds['age'].isna()] = birds['age'].mode()[0]

             birds  age  visits priority
labels
a           Cranes  3.5     2.0      yes
b           Cranes  4.0     4.0      yes
c          plovers  1.5     3.0       no
d              NaN  NaN     NaN      NaN
e       spoonbills  6.0     3.0       no
f           Cranes  3.0     4.0       no
g          plovers  5.5     2.0       no
h              NaN  NaN     NaN      NaN
i       spoonbills  8.0     3.0       no
j       spoonbills  4.0     2.0       no
k           Cranes  3.5     2.0      yes

### `Q-4`
i. Find the total number of visits of the bird Cranes

ii. Find the number of each type of birds in dataframe.

iii. Print no of duplicate rows

iv. Drop Duplicates rows and make this changes permanent. Show dataframe after changes.

In [19]:
birds['visits'].apply(lambda count: count + birds[birds['visits']] if 'birds' == 'Crane')

SyntaxError: expected 'else' after 'if' expression (3066080651.py, line 1)

In [ ]:
birds['visits'] = birds.apply(lambda row: row['visits'] + birds[birds['birds'] == 'Crane']['visits'].sum() if row['birds'] == 'Crane' else row['visits'], axis = 1)

In [ ]:
# iii.
birds.duplicated().sum()

np.int64(2)

In [ ]:
birds[birds.duplicated()]

         birds  age  visits priority
labels
h          NaN  NaN     NaN      NaN
k       Cranes  3.5     2.0      yes

In [ ]:
birds.drop(birds[birds.duplicated()], axis=1)
birds

             birds  age  visits priority
labels
a           Cranes  3.5     2.0      yes
b           Cranes  4.0     4.0      yes
c          plovers  1.5     3.0       no
d              NaN  NaN     NaN      NaN
e       spoonbills  6.0     3.0       no
f           Cranes  3.0     4.0       no
g          plovers  5.5     2.0       no
h              NaN  NaN     NaN      NaN
i       spoonbills  8.0     3.0       no
j       spoonbills  4.0     2.0       no
k           Cranes  3.5     2.0      yes

In [ ]:
# iv.
birds.drop(lambda row: row in birds[birds.duplicated()], axis=1)

KeyError: '[<function <lambda> at 0x72bc1daed240>] not found in axis'

##Question on IPL Data

IPL Data Link :  https://drive.google.com/file/d/1yKVUuexl6lIKuFQy7uIPgDgXhJ0L4SIg/view?usp=share_link

https://www.kaggle.com/datasets/vora1011/ipl-2008-to-2021-all-match-dataset?select=IPL_Matches_2008_2022.csv

Download ipl matches 2008-2022 file.

In [6]:
ipl = pd.read_csv('ipl-matches.csv')

### `Q-5:` In IPL matches dataset some teams name has changed.
You will have to consider them as same.
```
'Delhi Capitals' formerly as 'Delhi Daredevils'
'Punjab Kings' formerly as 'Kings XI Punjab'
'Rising Pune Supergiant' formerly as 'Rising Pune Supergiants'
```
You need to make changes accordingly. Consider current name for each teams.

Be careful Gujrat Titans and Gujrat Lions are different teams.

In [5]:
ipl.head(3)

,ID,City,Date,Season,MatchNumber,Team1,Team2,Venue,TossWinner,TossDecision,SuperOver,WinningTeam,WonBy,Margin,method,Player_of_Match,Team1Players,Team2Players,Umpire1,Umpire2
0,1312200,Ahmedabad,2022-05-29,2022,Final,Rajasthan Royals,Gujarat Titans,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,bat,N,Gujarat Titans,Wickets,7.0,NaN,HH Pandya,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...","['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pan...",CB Gaffaney,Nitin Menon
1,1312199,Ahmedabad,2022-05-27,2022,Qualifier 2,Royal Challengers Bangalore,Rajasthan Royals,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,field,N,Rajasthan Royals,Wickets,7.0,NaN,JC Buttler,"['V Kohli', 'F du Plessis', 'RM Patidar', 'GJ ...","['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...",CB Gaffaney,Nitin Menon
2,1312198,Kolkata,2022-05-25,2022,Eliminator,Royal Challengers Bangalore,Lucknow Super Giants,"Eden Gardens, Kolkata",Lucknow Super Giants,field,N,Royal Challengers Bangalore,Runs,14.0,NaN,RM Patidar,"['V Kohli', 'F du Plessis', 'RM Patidar', 'GJ ...","['Q de Kock', 'KL Rahul', 'M Vohra', 'DJ Hooda...",J Madanagopal,MA Gough

In [7]:
ipl.replace('Delhi Daredevils', 'Delhi Capitals', inplace=True)
ipl.replace('Kings XI Punjab', 'Punjab Kings', inplace=True)
ipl.replace('Rising Pune Supergiant', 'Rising Pune Supergiants', inplace=True)

### `Q-6` Write a code which can display the bar chart of top 5 teams who have played maximum number of matches in the IPL.
>  Hint: Be careful the data is divided in 2 different cols(Team 1 and Team 2)

In [ ]:
ipl['AllTeams'] = ipl['Team1'] + ',' + ipl['Team2']
ipl['AllTeams'] = ipl['AllTeams'].apply(lambda x: x.split(','))
ipl['AllTeams'].apply(lambda x: )

AllTeams
[Chennai Super Kings, Mumbai Indians]                   21
[Royal Challengers Bangalore, Kolkata Knight Riders]    19
[Royal Challengers Bangalore, Chennai Super Kings]      18
[Royal Challengers Bangalore, Mumbai Indians]           18
[Chennai Super Kings, Rajasthan Royals]                 17
                                                        ..
[Rajasthan Royals, Kochi Tuskers Kerala]                 1
[Kochi Tuskers Kerala, Chennai Super Kings]              1
[Mumbai Indians, Kochi Tuskers Kerala]                   1
[Pune Warriors, Kochi Tuskers Kerala]                    1
[Kochi Tuskers Kerala, Royal Challengers Bangalore]      1
Name: count, Length: 151, dtype: int64

###`Q-7:` Player who got Most no. of player of the match award playing against Mumbai Indians.
> Just for this question assume player of the match award is given to players from winning team. Although this is true in most of the cases.

In [ ]:
# code here

###`Q-8:` Team1 vs Team2 Dashbord
Create a function which will take two string(name of two teams) as input. Show win Loss record between them and player getting most player of the match award in matches between these two teams.
```
team1_vs_team2('Kolkata Knight Riders','Chennai Super Kings')
```

In [ ]:
# code here

### `Q-9:` Find out the top 7 cities where the matches of Kolkata Knight Riders are played frequently and plot the result as bar chart.

*`.plot(kind = "bar")` can help you to plot the bar chart. Also you can learn more about this method from [here](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.plot.html)*

In [ ]:
# code here

### `Q-10:` Find out the average margin for the team Mumbai Indians for only the session 2011.

In [ ]:
# code here